app/controllers/startups_controller.rb

  def edit
    @startup = Startup.find(params[:id])
---
SELECT "startups".* FROM "startups" WHERE "startups"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @startup = Startup.find(params[:id])
    @startup.update_attributes(params[:startup])
---
SELECT "startups".* FROM "startups" WHERE "startups"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "startups" SET "email" = 'email@email.com', "updated_at" = '2013-05-12 19:01:46.610972' WHERE "startups"."id" = 1

  def send_email
    @startup = Startup.find(params[:id])
---
SELECT "startups".* FROM "startups" WHERE "startups"."id" = ? LIMIT 1  [["id", "1"]]