app/controllers/startups_controller.rb

  def index
    @startups = Startup.all
---
SELECT "startups".* FROM "startups" ORDER BY presentation_order

  def create
    @startup = Startup.new(params[:startup])
    @startup.save
---
INSERT INTO "startups" ("angellist_id", "bio", "ceo_img_path", "ceo_name", "created_at", "email", "name", "order", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)