app/controllers/static_pages_controller.rb

SELECT "startups".* FROM "startups"
---
  def index
    @startups = Startup.all